redis_bench_result/set_32_6424.log
2023-11-21 22:44:09
====== SET ======
  20000000 requests completed in 92.69 seconds
  32 parallel clients
  32 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
1.10% <= 0.2 milliseconds
6.23% <= 0.3 milliseconds
14.62% <= 0.4 milliseconds
22.79% <= 0.5 milliseconds
31.43% <= 0.6 milliseconds
40.17% <= 0.7 milliseconds
48.67% <= 0.8 milliseconds
56.34% <= 0.9 milliseconds
63.09% <= 1.0 milliseconds
68.92% <= 1.1 milliseconds
73.83% <= 1.2 milliseconds
77.87% <= 1.3 milliseconds
81.18% <= 1.4 milliseconds
83.86% <= 1.5 milliseconds
86.03% <= 1.6 milliseconds
87.80% <= 1.7 milliseconds
89.26% <= 1.8 milliseconds
90.49% <= 1.9 milliseconds
91.53% <= 2 milliseconds
97.00% <= 3 milliseconds
98.79% <= 4 milliseconds
99.45% <= 5 milliseconds
99.73% <= 6 milliseconds
99.84% <= 7 milliseconds
99.88% <= 8 milliseconds
99.93% <= 9 milliseconds
99.95% <= 10 milliseconds
99.96% <= 11 milliseconds
99.98% <= 12 milliseconds
99.99% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 17 milliseconds
100.00% <= 18 milliseconds
100.00% <= 18 milliseconds
215773.00 requests per second