redis_bench_result/set_64_6428.log
2023-11-21 22:48:50
====== SET ======
  20000128 requests completed in 97.06 seconds
  32 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.90% <= 0.2 milliseconds
5.34% <= 0.3 milliseconds
12.65% <= 0.4 milliseconds
19.90% <= 0.5 milliseconds
27.72% <= 0.6 milliseconds
36.08% <= 0.7 milliseconds
44.72% <= 0.8 milliseconds
52.81% <= 0.9 milliseconds
60.03% <= 1.0 milliseconds
66.22% <= 1.1 milliseconds
71.39% <= 1.2 milliseconds
75.66% <= 1.3 milliseconds
79.21% <= 1.4 milliseconds
82.16% <= 1.5 milliseconds
84.57% <= 1.6 milliseconds
86.57% <= 1.7 milliseconds
88.21% <= 1.8 milliseconds
89.58% <= 1.9 milliseconds
90.73% <= 2 milliseconds
96.66% <= 3 milliseconds
98.52% <= 4 milliseconds
99.29% <= 5 milliseconds
99.62% <= 6 milliseconds
99.78% <= 7 milliseconds
99.86% <= 8 milliseconds
99.90% <= 9 milliseconds
99.93% <= 10 milliseconds
99.95% <= 11 milliseconds
99.97% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 17 milliseconds
100.00% <= 19 milliseconds
100.00% <= 20 milliseconds
100.00% <= 21 milliseconds
100.00% <= 22 milliseconds
100.00% <= 24 milliseconds
100.00% <= 25 milliseconds
100.00% <= 25 milliseconds
206061.55 requests per second